loadtest/artillery.yaml
config:
  target: "ws://localhost:8080/ws-chat"
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 200

  engines:
    ws:
      headers:
        Cookie: "accessToken={{{token}}"

  variables:
    stomp_connect: "CONNECT\naccept-version:1.2\nhost:localhost\n\n\0"
    stomp_subscribe: "SUBSCRIBE\nid:sub-1\ndestination:/topic/rooms/general\n\n\0"
    stomp_subscribe1: "SUBSCRIBE\nid:sub-1\ndestination:/topic/rooms/finland\n\n\0"
    stomp_send1: "SEND\ndestination:/app/chat.sendMessage\n\n{\"roomId\":\"general\",\"content\":\"Hello from Artillery\",\"sender\":\"John\"}\0"
    stomp_send2: "SEND\ndestination:/app/chat.sendMessage\n\n{\"roomId\":\"general\",\"content\":\"Second message\",\"sender\":\"Peter\"}\0"
    stomp_send3: "SEND\ndestination:/app/chat.sendMessage\n\n{\"roomId\":\"finland\",\"content\":\"Hello from Artillery\",\"sender\":\"Joni\"}\0"
    stomp_send4: "SEND\ndestination:/app/chat.sendMessage\n\n{\"roomId\":\"finland\",\"content\":\"Second message\",\"sender\":\"Petri\"}\0"
    stomp_send5: "SEND\ndestination:/app/chat.sendMessage\n\n{\"roomId\":\"sports\",\"content\":\"Second message\",\"sender\":\"Petri\"}\0"

  processor: "./processor.js"

scenarios:
  - name: stomp-chat
    engine: "ws"
    flow:
      - send: "{{ stomp_connect }}"
      - send: "{{ stomp_subscribe }}"
      - send: "{{ stomp_subscribe1 }}"
      - send: "{{ stomp_send1 }}"
      - think: 1
      - send: "{{ stomp_send2 }}"
      - think: 1
      - send: "{{ stomp_send3 }}"
      - think: 1
      - send: "{{ stomp_send4 }}"
      - think: 1
      - send: "{{ stomp_send5 }}"